
// Точка входа для запроса http.
// 
Функция pushevent(Запрос)
	Данные = Запрос.ПолучитьТелоКакСтроку();	
	Попытка
		ДанныеОповещения = Вычислить(Данные);
		ДанныеПолучилосьОбработать = Истина;
	Исключение
		ДанныеПолучилосьОбработать = Ложь;
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Если ДанныеПолучилосьОбработать = Истина Тогда
		ДанныеПолучилосьОбработать = ОтправитьСообщеинеНаСервере(ДанныеОповещения);
	КонецЕсли; 	

	Если ДанныеПолучилосьОбработать = Истина Тогда
		Ответ.УстановитьТелоИзСтроки("{'result': 'ok'}");
	Иначе	
		Ответ.УстановитьТелоИзСтроки("{'result': 'fail'}");	
	КонецЕсли; 	
	
	Возврат Ответ;
КонецФункции

// Отправка данных на клиент.
// 
Функция ОтправитьСообщеинеНаСервере(Данные)
	КлючОбсуждения 		= МИКО_тИнтеграция1СТелефонияСервер.КлючСлужебногоОбсуждения();
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат Ложь;	
	КонецЕсли; 
	
	СлужебноеОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсуждения);
	Если НЕ СлужебноеОбсуждение = Неопределено Тогда
		Идентификатор = СлужебноеОбсуждение.Идентификатор;
		Сообщение 	  = СистемаВзаимодействия.СоздатьСообщение(Идентификатор); 
	    Сообщение.Данные = Данные; 
	    Сообщение.Записать();
	КонецЕсли; 
	Возврат Истина;	
КонецФункции
